#    -*- mode: org -*-


Archived entries from file /home/alex/org/projects/bisonex.org


* KILL Répartition par chromosome: variable mais seul le 6 = hotspot
CLOSED: [2023-03-07 Tue 22:44]
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-13 lun. 15:55
:ARCHIVE_FILE: c:/Users/apraga/org/projects/bisonex.org
:ARCHIVE_OLPATH: Tests/Validation : NA12878/GIAB/Exons seuls/D'où vient la différence ?/Statistiques
:ARCHIVE_CATEGORY: GIAB
:ARCHIVE_TODO: KILL
:END:
#+begin_src julia
using CSV, DataFrames
f = DataFrame(CSV.File("count.csv", header=false))
size(f[f.Column2 .< 10,:])
#+end_src
(4430, 2)


#+begin_src julia
using CSV, DataFrames

function cleanCount(fname)
    f = DataFrame(CSV.File(fname, header=false))
    transform!(f, :Column1 => ByRow(x -> string.(split(x, ":"))[1]) => :chrom)
    transform!(f, :Column1 => ByRow(x -> string.(split(x, "-"))[2]) => :pos)
    select!(f, Not([:Column1]))
    rename!(f, :Column2 => :nb)
end

f = cleanCount("count.csv")
grouped = groupby(f, :chrom)
for (k, g) in pairs(grouped)
    println("$(k.chrom): $(size(g, 1))")
end
#+end_src

#+RESULTS:
: NC_000001.11: 448
: NC_000002.12: 307
: NC_000003.12: 228
: NC_000004.12: 175
: NC_000005.10: 237
: NC_000006.12: 1223
: NC_000007.14: 274
: NC_000008.11: 414
: NC_000009.12: 161
: NC_000010.11: 194
: NC_000011.10: 304
: NC_000012.12: 254
: NC_000013.11: 168
: NC_000014.9: 184
: NC_000015.10: 250
: NC_000016.10: 239
: NC_000017.11: 373
: NC_000018.10: 85
: NC_000019.10: 576
: NC_000020.11: 83
: NC_000021.9: 67
: NC_000022.11: 117


